[
  "Hãy định nghĩa thuật ngữ \"lập trình\".",
  "Giải thích sự khác biệt giữa ngôn ngữ lập trình bậc cao và ngôn ngữ lập trình bậc thấp.",
  "Mô tả quá trình biên dịch và thông dịch chương trình.",
  "Liệt kê các bước cơ bản trong việc giải quyết một bài toán bằng lập trình.",
  "Định nghĩa biến và hằng trong lập trình.",
  "Giải thích sự khác biệt giữa kiểu dữ liệu số nguyên và số thực.",
  "Nêu các kiểu dữ liệu cơ bản thường gặp trong lập trình.",
  "Viết chương trình in ra màn hình câu chào \"Hello, world!\".",
  "Viết chương trình tính tổng của hai số nguyên.",
  "Viết chương trình tính diện tích hình chữ nhật.",
  "Giải thích cú pháp câu lệnh điều kiện `if-else`.",
  "Viết chương trình kiểm tra một số nguyên có phải là số chẵn hay không.",
  "Viết chương trình tìm số lớn nhất trong ba số nguyên.",
  "Giải thích cú pháp vòng lặp `for`.",
  "Viết chương trình in ra bảng cửu chương 2.",
  "Viết chương trình tính tổng các số từ 1 đến n.",
  "Giải thích cú pháp vòng lặp `while`.",
  "Viết chương trình tính giai thừa của một số nguyên.",
  "So sánh vòng lặp `for` và vòng lặp `while`.",
  "Giải thích khái niệm mảng một chiều.",
  "Viết chương trình nhập vào một mảng số nguyên và in ra các phần tử của mảng.",
  "Viết chương trình tìm phần tử lớn nhất trong một mảng số nguyên.",
  "Viết chương trình tính tổng các phần tử trong một mảng số nguyên.",
  "Giải thích khái niệm hàm (function).",
  "Viết một hàm tính diện tích hình tròn.",
  "Viết một hàm tính tổng của hai số.",
  "Giải thích ý nghĩa của việc truyền tham số vào hàm.",
  "Giải thích sự khác biệt giữa biến cục bộ và biến toàn cục.",
  "Viết chương trình sử dụng hàm để tính trung bình cộng của ba số.",
  "Giải thích khái niệm về cấu trúc dữ liệu.",
  "So sánh mảng và cấu trúc.",
  "Viết chương trình quản lý thông tin sinh viên sử dụng cấu trúc.",
  "Giải thích khái niệm con trỏ.",
  "Giải thích cách khai báo và sử dụng con trỏ.",
  "Viết chương trình sử dụng con trỏ để đảo ngược một chuỗi ký tự.",
  "Giải thích khái niệm về đệ quy.",
  "Viết hàm đệ quy tính giai thừa của một số.",
  "Viết hàm đệ quy tính số Fibonacci thứ n.",
  "So sánh đệ quy và vòng lặp.",
  "Giải thích khái niệm về cấu trúc dữ liệu cây.",
  "Mô tả cấu trúc dữ liệu cây nhị phân.",
  "Mô tả cấu trúc dữ liệu danh sách liên kết.",
  "So sánh mảng và danh sách liên kết.",
  "Viết chương trình xử lý ngoại lệ (exception handling).",
  "Giải thích tầm quan trọng của việc xử lý ngoại lệ.",
  "Viết chương trình đọc dữ liệu từ file.",
  "Viết chương trình ghi dữ liệu vào file.",
  "Giải thích khái niệm về lập trình hướng đối tượng (OOP).",
  "Định nghĩa lớp và đối tượng trong OOP.",
  "Giải thích các tính chất của OOP: đóng gói, kế thừa, đa hình.",
  "Viết chương trình minh họa khái niệm đóng gói trong OOP.",
  "Viết chương trình minh họa khái niệm kế thừa trong OOP.",
  "Viết chương trình minh họa khái niệm đa hình trong OOP.",
  "Giải thích khái niệm về abstract class.",
  "Giải thích khái niệm về interface.",
  "So sánh abstract class và interface.",
  "Viết chương trình sử dụng interface.",
  "Giải thích khái niệm về generic programming.",
  "Viết chương trình sử dụng generic.",
  "Giải thích tầm quan trọng của việc viết code sạch.",
  "Nêu các nguyên tắc để viết code sạch.",
  "Giải thích khái niệm về debug.",
  "Nêu các kỹ thuật debug cơ bản.",
  "Sử dụng công cụ debug để tìm lỗi trong chương trình.",
  "Giải thích khái niệm về thuật toán.",
  "Mô tả thuật toán tìm kiếm tuyến tính.",
  "Mô tả thuật toán tìm kiếm nhị phân.",
  "So sánh thuật toán tìm kiếm tuyến tính và tìm kiếm nhị phân.",
  "Mô tả thuật toán sắp xếp nổi bọt.",
  "Mô tả thuật toán sắp xếp chèn.",
  "Mô tả thuật toán sắp xếp chọn.",
  "So sánh các thuật toán sắp xếp: nổi bọt, chèn, chọn.",
  "Giải thích khái niệm về độ phức tạp thuật toán.",
  "Phân tích độ phức tạp của thuật toán tìm kiếm tuyến tính.",
  "Phân tích độ phức tạp của thuật toán tìm kiếm nhị phân.",
  "Phân tích độ phức tạp của thuật toán sắp xếp nổi bọt.",
  "Phân tích độ phức tạp của thuật toán sắp xếp chèn.",
  "Phân tích độ phức tạp của thuật toán sắp xếp chọn.",
  "Giải thích khái niệm về quản lý bộ nhớ.",
  "Giải thích khái niệm về tràn bộ nhớ (stack overflow).",
  "Giải thích khái niệm về rò rỉ bộ nhớ (memory leak).",
  "Viết chương trình minh họa rò rỉ bộ nhớ.",
  "Giải thích cách tránh rò rỉ bộ nhớ.",
  "Giải thích khái niệm về con trỏ null.",
  "Giải thích cách xử lý con trỏ null.",
  "Giải thích khái niệm về  thư viện.",
  "Cách sử dụng thư viện trong chương trình.",
  "Nêu một số thư viện lập trình phổ biến.",
  "Giải thích khái niệm về version control.",
  "Nêu các hệ thống version control phổ biến.",
  "Cách sử dụng Git cơ bản.",
  "Giải thích khái niệm về design pattern.",
  "Mô tả một số design pattern phổ biến.",
  "Giải thích tầm quan trọng của việc test code.",
  "Nêu các phương pháp test code phổ biến.",
  "Viết chương trình đơn giản và viết test case cho chương trình đó.",
  "Giải thích khái niệm về lập trình song song.",
  "Giải thích khái niệm về lập trình phân tán.",
  "So sánh lập trình song song và lập trình phân tán.",
  "Giải thích khái niệm về cơ sở dữ liệu.",
  "Giải thích khái niệm SQL.",
  "Viết câu lệnh SQL để tạo bảng.",
  "Viết câu lệnh SQL để thêm dữ liệu vào bảng.",
  "Viết câu lệnh SQL để truy vấn dữ liệu từ bảng.",
  "Viết câu lệnh SQL để cập nhật dữ liệu trong bảng.",
  "Viết câu lệnh SQL để xóa dữ liệu khỏi bảng.",
  "Giải thích khái niệm về index trong cơ sở dữ liệu.",
  "Giải thích khái niệm về normalization trong cơ sở dữ liệu.",
  "Viết một chương trình đơn giản để tương tác với cơ sở dữ liệu.",
  "Giải thích khái niệm về API.",
  "Cách sử dụng API trong chương trình.",
  "Nêu một số API phổ biến.",
  "Giải thích khái niệm về web service.",
  "So sánh API và web service.",
  "Viết chương trình gọi API và xử lý dữ liệu trả về.",
  "Giải thích khái niệm về lập trình mạng.",
  "Giải thích khái niệm về socket.",
  "Viết chương trình đơn giản sử dụng socket để truyền dữ liệu giữa hai máy tính.",
  "Giải thích khái niệm về bảo mật thông tin trong lập trình.",
  "Nêu một số biện pháp bảo mật thông tin cơ bản.",
  "Giải thích khái niệm về mã hóa dữ liệu.",
  "Nêu một số thuật toán mã hóa phổ biến.",
  "Giải thích khái niệm về  xử lý ảnh.",
  "Nêu một số thư viện xử lý ảnh phổ biến.",
  "Viết chương trình đơn giản để xử lý ảnh.",
  "Giải thích khái niệm về xử lý video.",
  "Nêu một số thư viện xử lý video phổ biến.",
  "Viết chương trình đơn giản để xử lý video.",
  "Giải thích khái niệm về trí tuệ nhân tạo (AI).",
  "Nêu một số ứng dụng của AI trong lập trình.",
  "Giải thích khái niệm về machine learning.",
  "Nêu một số thuật toán machine learning phổ biến.",
  "Giải thích khái niệm về deep learning.",
  "So sánh machine learning và deep learning.",
  "Viết chương trình đơn giản sử dụng thư viện machine learning.",
  "Giải thích khái niệm về  big data.",
  "Nêu một số công cụ xử lý big data phổ biến.",
  "Giải thích khái niệm về cloud computing.",
  "Nêu một số dịch vụ cloud computing phổ biến.",
  "Viết chương trình sử dụng dịch vụ cloud computing.",
  "Hãy cho biết mục đích của việc sử dụng comment trong code.",
  "Nêu quy tắc đặt tên biến tốt trong lập trình.",
  "Tại sao việc định dạng code tốt lại quan trọng?",
  "Giải thích tầm quan trọng của việc kiểm tra lỗi (error handling).",
  "So sánh hai kiểu vòng lặp `for` và `while` trong trường hợp nào thì nên sử dụng kiểu vòng lặp nào?",
  "Hãy giải thích khái niệm \"recursion\" (đệ quy) và đưa ra ví dụ minh họa.",
  "Viết chương trình tìm kiếm phần tử trong mảng sử dụng tìm kiếm tuyến tính.",
  "Viết chương trình tìm kiếm phần tử trong mảng đã được sắp xếp sử dụng tìm kiếm nhị phân.",
  "Viết chương trình sắp xếp mảng số nguyên sử dụng thuật toán sắp xếp nổi bọt.",
  "Viết chương trình sắp xếp mảng số nguyên sử dụng thuật toán sắp xếp chọn.",
  "Viết chương trình sắp xếp mảng số nguyên sử dụng thuật toán sắp xếp chèn.",
  "Hãy giải thích khái niệm \"pointer\" (con trỏ) trong C/C++.",
  "Viết chương trình sử dụng con trỏ để hoán đổi giá trị của hai biến.",
  "Hãy giải thích khái niệm \"dynamic memory allocation\" (cấp phát bộ nhớ động) trong C/C++.",
  "Viết chương trình tạo và giải phóng một mảng động.",
  "Hãy giải thích khái niệm \"structure\" (cấu trúc) trong C/C++.",
  "Viết chương trình tạo và sử dụng cấu trúc để lưu trữ thông tin sinh viên.",
  "Hãy giải thích khái niệm \"function\" (hàm) và  \"procedure\" (thủ tục) trong lập trình.",
  "Viết một hàm tính tổng của n số nguyên đầu tiên.",
  "Viết một hàm kiểm tra một số nguyên có phải là số nguyên tố hay không.",
  "Hãy giải thích sự khác biệt giữa giá trị trả về và tham số truyền vào trong hàm.",
  "Viết chương trình sử dụng hàm để tính diện tích hình tam giác.",
  "Hãy giải thích khái niệm \"scope\" (phạm vi) của biến trong lập trình.",
  "Hãy giải thích sự khác biệt giữa biến toàn cục và biến cục bộ.",
  "Viết chương trình minh họa sự khác biệt giữa biến toàn cục và biến cục bộ.",
  "Hãy giải thích khái niệm \"array\" (mảng) trong lập trình.",
  "Viết chương trình tính trung bình cộng các phần tử của một mảng.",
  "Viết chương trình tìm phần tử nhỏ nhất trong một mảng.",
  "Viết chương trình đảo ngược thứ tự các phần tử trong một mảng.",
  "Hãy giải thích khái niệm \"string\" (chuỗi) trong lập trình.",
  "Viết chương trình đếm số lượng ký tự trong một chuỗi.",
  "Viết chương trình tìm kiếm một ký tự trong một chuỗi.",
  "Viết chương trình thay thế một ký tự bằng một ký tự khác trong một chuỗi.",
  "Hãy giải thích khái niệm \"file I/O\" (đọc ghi file) trong lập trình.",
  "Viết chương trình đọc dữ liệu từ một file văn bản.",
  "Viết chương trình ghi dữ liệu vào một file văn bản.",
  "Viết chương trình sao chép nội dung của một file vào một file khác.",
  "Hãy giải thích khái niệm \"exception handling\" (xử lý ngoại lệ) trong lập trình.",
  "Viết chương trình xử lý ngoại lệ khi chia cho 0.",
  "Viết chương trình xử lý ngoại lệ khi mở file không tồn tại.",
  "Hãy giải thích khái niệm \"debugging\" (gỡ lỗi) trong lập trình.",
  "Nêu một số kỹ thuật gỡ lỗi chương trình.",
  "Hãy giải thích cách sử dụng trình gỡ lỗi (debugger).",
  "Hãy giải thích khái niệm \"algorithm\" (thuật toán) trong lập trình.",
  "Mô tả thuật toán tìm kiếm tuyến tính.",
  "Mô tả thuật toán tìm kiếm nhị phân.",
  "Mô tả thuật toán sắp xếp nổi bọt.",
  "Mô tả thuật toán sắp xếp chèn.",
  "Mô tả thuật toán sắp xếp trộn (merge sort).",
  "Mô tả thuật toán sắp xếp nhanh (quick sort).",
  "Hãy giải thích khái niệm \"data structure\" (cấu trúc dữ liệu) trong lập trình.",
  "Hãy giải thích sự khác biệt giữa mảng tĩnh và mảng động.",
  "Hãy giải thích khái niệm \"linked list\" (danh sách liên kết).",
  "Hãy giải thích khái niệm \"stack\" (ngăn xếp).",
  "Hãy giải thích khái niệm \"queue\" (hàng đợi).",
  "Hãy giải thích khái niệm \"tree\" (cây).",
  "Hãy giải thích khái niệm \"graph\" (đồ thị).",
  "Hãy giải thích khái niệm \"hash table\" (bảng băm).",
  "Hãy giải thích khái niệm \"time complexity\" (độ phức tạp thời gian) của thuật toán.",
  "Hãy giải thích khái niệm \"space complexity\" (độ phức tạp không gian) của thuật toán.",
  "Phân tích độ phức tạp thời gian của thuật toán tìm kiếm tuyến tính.",
  "Phân tích độ phức tạp thời gian của thuật toán tìm kiếm nhị phân.",
  "Phân tích độ phức tạp thời gian của thuật toán sắp xếp nổi bọt.",
  "Phân tích độ phức tạp thời gian của thuật toán sắp xếp chèn.",
  "Phân tích độ phức tạp thời gian của thuật toán sắp xếp trộn.",
  "Phân tích độ phức tạp thời gian của thuật toán sắp xếp nhanh.",
  "Hãy giải thích khái niệm \"object-oriented programming\" (lập trình hướng đối tượng).",
  "Hãy giải thích khái niệm \"class\" (lớp) và \"object\" (đối tượng).",
  "Hãy giải thích khái niệm \"encapsulation\" (đóng gói).",
  "Hãy giải thích khái niệm \"inheritance\" (kế thừa).",
  "Hãy giải thích khái niệm \"polymorphism\" (đa hình).",
  "Viết chương trình minh họa khái niệm đóng gói trong lập trình hướng đối tượng.",
  "Viết chương trình minh họa khái niệm kế thừa trong lập trình hướng đối tượng.",
  "Viết chương trình minh họa khái niệm đa hình trong lập trình hướng đối tượng.",
  "Hãy giải thích khái niệm \"abstract class\" (lớp trừu tượng).",
  "Hãy giải thích khái niệm \"interface\" (giao diện).",
  "Hãy giải thích sự khác biệt giữa lớp trừu tượng và giao diện.",
  "Viết chương trình sử dụng lớp trừu tượng.",
  "Viết chương trình sử dụng giao diện.",
  "Hãy giải thích khái niệm \"generic programming\" (lập trình chung).",
  "Viết chương trình sử dụng generic.",
  "Hãy giải thích khái niệm \"design pattern\" (kiểu thiết kế).",
  "Mô tả một số kiểu thiết kế phổ biến.",
  "Hãy giải thích khái niệm \"unit testing\" (kiểm thử đơn vị).",
  "Hãy giải thích khái niệm \"integration testing\" (kiểm thử tích hợp).",
  "Hãy giải thích khái niệm \"system testing\" (kiểm thử hệ thống).",
  "Hãy giải thích khái niệm \"software development lifecycle\" (vòng đời phát triển phần mềm).",
  "Mô tả các giai đoạn trong vòng đời phát triển phần mềm.",
  "Hãy giải thích khái niệm \"version control system\" (hệ thống quản lý phiên bản).",
  "Nêu một số hệ thống quản lý phiên bản phổ biến.",
  "Hãy giải thích cách sử dụng Git cơ bản.",
  "Hãy giải thích khái niệm \"clean code\" (code sạch).",
  "Nêu một số nguyên tắc để viết code sạch.",
  "Hãy giải thích khái niệm \"code review\" (xem xét code).",
  "Hãy giải thích khái niệm \"commenting\" (viết chú thích) trong code.",
  "Hãy giải thích khái niệm \"code style\" (kiểu code).",
  "Hãy giải thích khái niệm \"documentation\" (tài liệu) trong lập trình.",
  "Hãy giải thích tầm quan trọng của việc viết tài liệu tốt.",
  "Hãy giải thích khái niệm \"API\" (giao diện lập trình ứng dụng).",
  "Hãy giải thích khái niệm \"web service\" (dịch vụ web).",
  "Hãy giải thích khái niệm \"database\" (cơ sở dữ liệu).",
  "Hãy giải thích khái niệm \"SQL\" (ngôn ngữ truy vấn cấu trúc).",
  "Viết câu lệnh SQL để tạo bảng với các ràng buộc.",
  "Viết câu lệnh SQL để thêm dữ liệu vào bảng với ràng buộc khóa chính.",
  "Viết câu lệnh SQL để truy vấn dữ liệu từ nhiều bảng liên kết.",
  "Viết câu lệnh SQL để cập nhật dữ liệu trong bảng với ràng buộc.",
  "Viết câu lệnh SQL để xóa dữ liệu trong bảng với ràng buộc.",
  "Hãy giải thích khái niệm \"normalization\" (chuẩn hóa) trong cơ sở dữ liệu.",
  "Hãy giải thích khái niệm \"index\" (chỉ mục) trong cơ sở dữ liệu.",
  "Hãy giải thích khái niệm \"transaction\" (giao dịch) trong cơ sở dữ liệu.",
  "Hãy giải thích khái niệm \"concurrency control\" (kiểm soát đồng thời) trong cơ sở dữ liệu.",
  "Hãy giải thích khái niệm \"deadlock\" (tình trạng bế tắc) trong cơ sở dữ liệu.",
  "Hãy giải thích khái niệm \"network programming\" (lập trình mạng).",
  "Hãy giải thích khái niệm \"socket\" (ổ cắm) trong lập trình mạng.",
  "Viết chương trình đơn giản sử dụng socket để truyền dữ liệu giữa hai máy tính.",
  "Hãy giải thích khái niệm \"client-server architecture\" (kiến trúc máy chủ-máy khách).",
  "Hãy giải thích khái niệm \"multithreading\" (đa luồng).",
  "Hãy giải thích khái niệm \"multiprocessing\" (đa xử lý).",
  "Hãy giải thích sự khác biệt giữa đa luồng và đa xử lý.",
  "Hãy giải thích khái niệm \"concurrent programming\" (lập trình đồng thời).",
  "Hãy giải thích khái niệm \"parallel programming\" (lập trình song song).",
  "Hãy giải thích sự khác biệt giữa lập trình đồng thời và lập trình song song.",
  "Hãy giải thích khái niệm \"distributed systems\" (hệ thống phân tán).",
  "Hãy giải thích khái niệm \"cloud computing\" (điện toán đám mây).",
  "Nêu một số dịch vụ điện toán đám mây phổ biến.",
  "Hãy giải thích khái niệm \"big data\" (dữ liệu lớn).",
  "Nêu một số công cụ xử lý dữ liệu lớn phổ biến.",
  "Hãy giải thích khái niệm \"artificial intelligence\" (trí tuệ nhân tạo).",
  "Nêu một số ứng dụng của trí tuệ nhân tạo.",
  "Hãy giải thích khái niệm \"machine learning\" (học máy).",
  "Nêu một số thuật toán học máy phổ biến.",
  "Hãy giải thích khái niệm \"deep learning\" (học sâu).",
  "Hãy giải thích khái niệm \"computer vision\" (tầm nhìn máy tính).",
  "Hãy giải thích khái niệm \"natural language processing\" (xử lý ngôn ngữ tự nhiên).",
  "Hãy giải thích khái niệm \"security\" (bảo mật) trong lập trình.",
  "Nêu một số biện pháp bảo mật thông tin trong lập trình.",
  "Hãy giải thích khái niệm \"encryption\" (mã hóa).",
  "Nêu một số thuật toán mã hóa phổ biến.",
  "Hãy giải thích khái niệm \"authentication\" (xác thực).",
  "Hãy giải thích khái niệm \"authorization\" (ủy quyền).",
  "Hãy giải thích khái niệm \"image processing\" (xử lý ảnh).",
  "Nêu một số thư viện xử lý ảnh phổ biến.",
  "Hãy giải thích khái niệm \"video processing\" (xử lý video).",
  "Nêu một số thư viện xử lý video phổ biến.",
  "Hãy mô tả một tình huống thực tế cần sử dụng lập trình để giải quyết.",
  "Hãy thiết kế một chương trình nhỏ để giải quyết tình huống trên.",
  "Hãy mô tả một dự án lập trình nhỏ mà bạn có thể thực hiện.",
  "Hãy lập kế hoạch cho dự án lập trình đó.",
  "Hãy phân tích các khó khăn có thể gặp phải trong dự án lập trình đó.",
  "Hãy đề xuất các giải pháp để khắc phục các khó khăn đó.",
  "So sánh hai ngôn ngữ lập trình khác nhau (ví dụ: Python và Java).",
  "Đánh giá ưu điểm và nhược điểm của một ngôn ngữ lập trình cụ thể.",
  "Lý giải tại sao một thuật toán lại hiệu quả hơn thuật toán khác.",
  "So sánh hai cấu trúc dữ liệu khác nhau (ví dụ: mảng và danh sách liên kết).",
  "Đánh giá hiệu quả của một thuật toán trong một tình huống cụ thể.",
  "Lý giải sự lựa chọn của một cấu trúc dữ liệu cụ thể trong một dự án.",
  "Thiết kế một chương trình quản lý thư viện nhỏ.",
  "Thiết kế một chương trình quản lý điểm của học sinh.",
  "Thiết kế một chương trình quản lý bán hàng đơn giản.",
  "Thiết kế một trò chơi đơn giản sử dụng đồ họa.",
  "Mô tả cách thức bạn sẽ tiếp cận một bài toán lập trình mới.",
  "Giải thích tầm quan trọng của việc lập kế hoạch trước khi viết code.",
  "Đánh giá cách thức bạn sẽ kiểm tra tính chính xác của code mình đã viết.",
  "Lý giải tại sao việc viết code rõ ràng và dễ hiểu lại quan trọng.",
  "So sánh hai phương pháp tiếp cận khác nhau để giải quyết một bài toán lập trình.",
  "Phân tích một đoạn code đã cho và tìm lỗi trong đó.",
  "Đề xuất các cải tiến cho đoạn code đã cho.",
  "Viết chương trình giải phương trình bậc hai.",
  "Viết chương trình tính số ngày trong một tháng.",
  "Viết chương trình kiểm tra một năm có phải là năm nhuận hay không.",
  "Viết chương trình tính khoảng cách giữa hai điểm trong không gian 2 chiều.",
  "Viết chương trình tính diện tích hình tam giác khi biết độ dài ba cạnh.",
  "Viết chương trình tính thể tích hình cầu.",
  "Viết chương trình chuyển đổi nhiệt độ từ Celsius sang Fahrenheit.",
  "Viết chương trình chuyển đổi nhiệt độ từ Fahrenheit sang Celsius.",
  "Viết chương trình tính tiền lãi đơn.",
  "Viết chương trình tính tiền lãi kép.",
  "Viết chương trình tính tổng của một dãy số.",
  "Viết chương trình tính tích của một dãy số.",
  "Viết chương trình tìm ước số chung lớn nhất của hai số nguyên.",
  "Viết chương trình tìm bội số chung nhỏ nhất của hai số nguyên.",
  "Viết chương trình kiểm tra một số có phải là số hoàn hảo hay không.",
  "Viết chương trình kiểm tra một số có phải là số Armstrong hay không.",
  "Viết chương trình in ra các số nguyên tố trong một khoảng cho trước.",
  "Viết chương trình in ra dãy Fibonacci trong một khoảng cho trước.",
  "Viết chương trình tìm kiếm một phần tử trong một danh sách liên kết.",
  "Viết chương trình thêm một phần tử vào đầu của một danh sách liên kết.",
  "Viết chương trình thêm một phần tử vào cuối của một danh sách liên kết.",
  "Viết chương trình xóa một phần tử khỏi một danh sách liên kết.",
  "Viết chương trình đảo ngược một danh sách liên kết.",
  "Viết chương trình thực hiện các phép toán cơ bản trên ngăn xếp.",
  "Viết chương trình thực hiện các phép toán cơ bản trên hàng đợi.",
  "Viết chương trình duyệt cây nhị phân theo thứ tự trước, giữa, sau.",
  "Viết chương trình tìm kiếm một nút trong cây nhị phân.",
  "Viết chương trình thêm một nút vào cây nhị phân.",
  "Viết chương trình xóa một nút khỏi cây nhị phân.",
  "Viết chương trình duyệt đồ thị bằng thuật toán DFS.",
  "Viết chương trình duyệt đồ thị bằng thuật toán BFS.",
  "Viết chương trình tìm đường đi ngắn nhất giữa hai nút trong đồ thị.",
  "Viết chương trình tính toán hash value của một chuỗi.",
  "Viết chương trình quản lý sinh viên sử dụng mảng.",
  "Viết chương trình quản lý sinh viên sử dụng danh sách liên kết.",
  "Viết chương trình quản lý sách trong một thư viện.",
  "Viết chương trình quản lý sản phẩm trong một cửa hàng.",
  "Viết chương trình tính toán lương nhân viên.",
  "Viết chương trình quản lý điểm thi của học sinh.",
  "Viết chương trình tính toán thuế thu nhập cá nhân.",
  "Viết chương trình quản lý lịch hẹn.",
  "Viết chương trình quản lý công việc.",
  "Viết chương trình quản lý chi tiêu cá nhân.",
  "Định nghĩa thuật toán là gì?",
  "Hãy giải thích khái niệm biến trong lập trình.",
  "Kiểu dữ liệu số nguyên (integer) được dùng để lưu trữ loại thông tin nào?",
  "So sánh sự khác nhau giữa kiểu dữ liệu số nguyên và số thực.",
  "Biến nào sau đây là biến hợp lệ trong C++:  a) 123bien; b) bien_123; c) bien 123; d) bien-123?",
  "Viết lệnh gán giá trị 10 cho biến x.",
  "Viết lệnh in ra màn hình giá trị của biến x.",
  "Hãy giải thích ý nghĩa của toán tử gán (=).",
  "Thứ tự ưu tiên của các toán tử trong biểu thức toán học là như thế nào?",
  "Viết biểu thức toán học tính tổng của hai biến a và b.",
  "Viết biểu thức toán học tính hiệu của hai biến a và b.",
  "Viết biểu thức toán học tính tích của hai biến a và b.",
  "Viết biểu thức toán học tính thương của hai biến a và b.",
  "Viết biểu thức toán học tính phần dư của phép chia a cho b.",
  "Sự khác nhau giữa ++x và x++ là gì?",
  "Hãy giải thích khái niệm câu điều kiện (if-else).",
  "Viết câu lệnh điều kiện kiểm tra xem một số có lớn hơn 0 hay không.",
  "Viết câu lệnh điều kiện kiểm tra xem một số có bằng 0 hay không.",
  "Viết câu lệnh điều kiện kiểm tra xem một số có nhỏ hơn 0 hay không.",
  "Hãy giải thích khái niệm vòng lặp (loop).",
  "So sánh vòng lặp for và vòng lặp while.",
  "Viết vòng lặp for in ra màn hình các số từ 1 đến 10.",
  "Viết vòng lặp while in ra màn hình các số từ 1 đến 10.",
  "Viết chương trình tính tổng các số từ 1 đến n (n được nhập từ bàn phím).",
  "Viết chương trình tính giai thừa của một số nguyên dương.",
  "Hãy giải thích khái niệm mảng (array).",
  "Khai báo một mảng chứa 10 số nguyên.",
  "Nhập giá trị cho các phần tử của mảng đã khai báo.",
  "In ra màn hình các phần tử của mảng đã nhập.",
  "Viết chương trình tìm giá trị lớn nhất trong một mảng.",
  "Viết chương trình tìm giá trị nhỏ nhất trong một mảng.",
  "Viết chương trình tính tổng các phần tử của một mảng.",
  "Viết chương trình tìm kiếm một phần tử trong mảng.",
  "Sửa lỗi cú pháp trong đoạn code sau: `int x = 5; cout << \"Gia tri cua x la: \" << x;`",
  "Sửa lỗi logic trong đoạn code sau:  `if (x > 5) cout << \"x lon hon 5\"; else cout << \"x nho hon 5\";` (khi x=5)",
  "Giải thích lỗi biên dịch \"undeclared identifier\".",
  "Giải thích lỗi runtime \"division by zero\".",
  "Viết hàm tính tổng hai số nguyên.",
  "Viết hàm tính hiệu hai số nguyên.",
  "Viết hàm tính tích hai số nguyên.",
  "Viết hàm tính thương hai số nguyên.",
  "So sánh hàm và thủ tục.",
  "Giải thích khái niệm hàm đệ quy.",
  "Viết hàm đệ quy tính giai thừa của một số nguyên dương.",
  "Viết hàm đệ quy tính số Fibonacci thứ n.",
  "Hãy giải thích khái niệm con trỏ (pointer).",
  "Khai báo một con trỏ kiểu số nguyên.",
  "Gán địa chỉ của một biến cho một con trỏ.",
  "Truy cập giá trị của một biến thông qua con trỏ.",
  "So sánh mảng và con trỏ.",
  "Giải thích khái niệm cấu trúc dữ liệu (data structure).",
  "Mô tả cấu trúc dữ liệu danh sách liên kết (linked list).",
  "Mô tả cấu trúc dữ liệu cây (tree).",
  "Mô tả cấu trúc dữ liệu stack.",
  "Mô tả cấu trúc dữ liệu queue.",
  "So sánh ưu nhược điểm của các cấu trúc dữ liệu đã học.",
  "Viết chương trình quản lý sinh viên sử dụng mảng.",
  "Viết chương trình quản lý sinh viên sử dụng cấu trúc.",
  "Viết chương trình tìm kiếm nhị phân (binary search).",
  "Viết chương trình sắp xếp nổi bọt (bubble sort).",
  "Viết chương trình sắp xếp chèn (insertion sort).",
  "Viết chương trình sắp xếp chọn (selection sort).",
  "So sánh độ phức tạp thuật toán của các thuật toán sắp xếp đã học.",
  "Giải thích khái niệm về file trong lập trình.",
  "Cách mở một file để đọc dữ liệu.",
  "Cách mở một file để ghi dữ liệu.",
  "Cách đóng một file.",
  "Viết chương trình đọc dữ liệu từ một file văn bản.",
  "Viết chương trình ghi dữ liệu vào một file văn bản.",
  "Xử lý ngoại lệ khi mở file không thành công.",
  "Tìm hiểu về các kiểu file khác nhau (ví dụ: text file, binary file).",
  "Giải thích khái niệm về OOP (Object-Oriented Programming).",
  "Định nghĩa lớp (class) trong OOP.",
  "Định nghĩa đối tượng (object) trong OOP.",
  "Giải thích khái niệm tính đóng gói (encapsulation) trong OOP.",
  "Giải thích khái niệm tính kế thừa (inheritance) trong OOP.",
  "Giải thích khái niệm tính đa hình (polymorphism) trong OOP.",
  "Viết một lớp mô tả thông tin của một sinh viên.",
  "Viết một lớp mô tả thông tin của một sản phẩm.",
  "Viết một lớp kế thừa từ lớp sinh viên để mô tả thông tin của một giảng viên.",
  "Áp dụng tính đa hình để tạo ra các hàm tính diện tích cho các hình khác nhau (hình chữ nhật, hình tròn).",
  "So sánh lập trình thủ tục và lập trình hướng đối tượng.",
  "Lợi ích của việc sử dụng OOP trong lập trình.",
  "Giải thích khái niệm về exception handling.",
  "Viết chương trình xử lý ngoại lệ khi chia cho 0.",
  "Viết chương trình xử lý ngoại lệ khi mở file không thành công.",
  "So sánh try-catch và try-except.",
  "Giải thích khái niệm về debug.",
  "Cách sử dụng debugger để tìm lỗi trong chương trình.",
  "Các bước để debug một chương trình hiệu quả.",
  "Phân biệt lỗi cú pháp, lỗi logic và lỗi runtime.",
  "Cách đọc và hiểu thông báo lỗi biên dịch.",
  "Cách sử dụng các công cụ hỗ trợ lập trình (IDE).",
  "Ưu điểm và nhược điểm của việc sử dụng IDE.",
  "Viết chương trình tính tiền điện dựa trên mức tiêu thụ.",
  "Viết chương trình tính điểm trung bình của sinh viên.",
  "Viết chương trình quản lý thư viện đơn giản.",
  "Viết chương trình quản lý kho hàng đơn giản.",
  "Thiết kế một chương trình quản lý học sinh cho một trường học.",
  "Thiết kế một chương trình quản lý bán hàng cho một cửa hàng.",
  "Nếu một chương trình chạy không đúng, bạn sẽ bắt đầu tìm lỗi ở đâu?",
  "Tại sao việc viết code rõ ràng và có chú thích lại quan trọng?",
  "Hãy giải thích tầm quan trọng của việc test code.",
  "So sánh các phương pháp test code khác nhau (unit test, integration test).",
  "Viết một chương trình đơn giản để minh họa cho khái niệm recursion.",
  "Làm thế nào để tránh stack overflow khi sử dụng recursion?",
  "Hãy giải thích khái niệm về Big O notation.",
  "Phân tích độ phức tạp của thuật toán tìm kiếm tuyến tính.",
  "Phân tích độ phức tạp của thuật toán tìm kiếm nhị phân.",
  "Phân tích độ phức tạp của thuật toán sắp xếp nổi bọt.",
  "Phân tích độ phức tạp của thuật toán sắp xếp nhanh (quicksort).",
  "So sánh hiệu quả của các thuật toán tìm kiếm và sắp xếp.",
  "Giải thích khái niệm về version control (ví dụ: Git).",
  "Tại sao việc sử dụng version control lại quan trọng trong lập trình?",
  "Nêu ra một vài lợi ích của việc sử dụng version control.",
  "Hãy giải thích khái niệm về clean code.",
  "Tại sao việc viết clean code lại quan trọng?",
  "Nêu ra một vài nguyên tắc để viết clean code.",
  "So sánh hai đoạn code thực hiện cùng một chức năng nhưng có style khác nhau.",
  "Viết chương trình tính diện tích của một tam giác.",
  "Viết chương trình tính thể tích của một hình lập phương.",
  "Viết chương trình tính chu vi của một hình tròn.",
  "Viết chương trình chuyển đổi độ C sang độ F.",
  "Viết chương trình chuyển đổi độ F sang độ C.",
  "Viết chương trình kiểm tra một số có phải là số nguyên tố hay không.",
  "Viết chương trình tìm ước số chung lớn nhất của hai số nguyên.",
  "Viết chương trình tìm bội số chung nhỏ nhất của hai số nguyên.",
  "Viết chương trình in ra bảng cửu chương.",
  "Viết chương trình in ra tam giác Pascal.",
  "Viết chương trình giải phương trình bậc hai.",
  "Viết chương trình tính tổng các số chẵn trong một khoảng cho trước.",
  "Viết chương trình tính tổng các số lẻ trong một khoảng cho trước.",
  "Viết chương trình đếm số lượng số chẵn và số lẻ trong một mảng.",
  "Viết chương trình tìm số lớn nhất và số nhỏ nhất trong một mảng.",
  "Viết chương trình tính trung bình cộng của các số trong một mảng.",
  "Viết chương trình đảo ngược một chuỗi ký tự.",
  "Viết chương trình kiểm tra một chuỗi ký tự có phải là palindrome hay không.",
  "Viết chương trình đếm số lần xuất hiện của một ký tự trong một chuỗi.",
  "Viết chương trình sắp xếp một chuỗi ký tự theo thứ tự bảng chữ cái.",
  "Viết chương trình xóa các ký tự trùng lặp trong một chuỗi.",
  "Mô tả quá trình phát triển phần mềm theo mô hình thác nước (waterfall).",
  "Mô tả quá trình phát triển phần mềm theo mô hình Agile.",
  "So sánh hai mô hình phát triển phần mềm waterfall và Agile.",
  "Tại sao việc lập kế hoạch là quan trọng trong quá trình phát triển phần mềm?",
  "Những yếu tố nào cần được xem xét khi lập kế hoạch phát triển phần mềm?",
  "Giải thích khái niệm về testing trong quá trình phát triển phần mềm.",
  "Tại sao việc testing là quan trọng trong quá trình phát triển phần mềm?",
  "Các loại testing phổ biến trong quá trình phát triển phần mềm là gì?",
  "Mô tả quá trình deploy một ứng dụng.",
  "Những vấn đề thường gặp khi deploy một ứng dụng là gì?"
]