[
  "Hãy định nghĩa thuật ngữ \"lập trình\".",
  "Giải thích khái niệm biến trong lập trình.",
  "Liệt kê 5 kiểu dữ liệu cơ bản thường gặp trong lập trình.",
  "Mô tả sự khác biệt giữa biến toàn cục và biến cục bộ.",
  "Viết cú pháp khai báo biến trong ngôn ngữ C++.",
  "Giải thích khái niệm hằng số trong lập trình.",
  "Viết cú pháp khai báo hằng số trong ngôn ngữ Java.",
  "Thế nào là toán tử gán? Cho ví dụ.",
  "So sánh toán tử cộng và toán tử trừ.",
  "Giải thích hoạt động của toán tử modulo (%).",
  "Viết chương trình tính tổng hai số nguyên.",
  "Viết chương trình tính diện tích hình chữ nhật.",
  "Viết chương trình tính chu vi hình tròn.",
  "Giải thích cú pháp câu lệnh điều kiện if-else.",
  "Viết chương trình kiểm tra một số nguyên có chia hết cho 2 không.",
  "Viết chương trình kiểm tra một số nguyên dương có phải là số nguyên tố hay không.",
  "Giải thích vòng lặp for.",
  "Viết chương trình in ra các số chẵn từ 1 đến 100.",
  "Viết chương trình tính tổng các số từ 1 đến n.",
  "Giải thích vòng lặp while.",
  "Viết chương trình tính giai thừa của một số nguyên dương.",
  "So sánh vòng lặp for và vòng lặp while.",
  "Giải thích khái niệm mảng.",
  "Khai báo và khởi tạo một mảng số nguyên có 10 phần tử.",
  "Viết chương trình tìm giá trị lớn nhất trong một mảng.",
  "Viết chương trình tìm giá trị nhỏ nhất trong một mảng.",
  "Viết chương trình tính tổng các phần tử trong một mảng.",
  "Giải thích khái niệm hàm (function).",
  "Viết một hàm tính tổng hai số nguyên.",
  "Viết một hàm tính diện tích hình tam giác.",
  "Giải thích sự khác biệt giữa hàm void và hàm có trả về giá trị.",
  "Viết chương trình sử dụng hàm để tính bình phương của một số.",
  "Giải thích về phạm vi biến trong hàm.",
  "Xử lý lỗi \"undefined variable\" trong C++.",
  "Xử lý lỗi \"type mismatch\" trong Java.",
  "Cách debug chương trình bằng cách sử dụng breakpoint.",
  "Giải thích khái niệm con trỏ.",
  "Khai báo và sử dụng con trỏ trong C++.",
  "So sánh mảng và con trỏ.",
  "Giải thích khái niệm cấu trúc dữ liệu.",
  "Định nghĩa cấu trúc dữ liệu \"danh sách liên kết\".",
  "So sánh mảng và danh sách liên kết.",
  "Giải thích khái niệm đệ quy.",
  "Viết hàm tính giai thừa sử dụng đệ quy.",
  "Viết hàm tính số Fibonacci sử dụng đệ quy.",
  "So sánh đệ quy và vòng lặp.",
  "Giải thích khái niệm sắp xếp.",
  "Mô tả thuật toán sắp xếp nổi bọt (Bubble Sort).",
  "Mô tả thuật toán sắp xếp chọn (Selection Sort).",
  "So sánh Bubble Sort và Selection Sort.",
  "Giải thích khái niệm tìm kiếm.",
  "Mô tả thuật toán tìm kiếm tuyến tính.",
  "Mô tả thuật toán tìm kiếm nhị phân.",
  "So sánh tìm kiếm tuyến tính và tìm kiếm nhị phân.",
  "Viết chương trình sắp xếp mảng số nguyên tăng dần.",
  "Viết chương trình tìm kiếm một phần tử trong mảng.",
  "Giải thích khái niệm cấu trúc dữ liệu cây.",
  "Định nghĩa cây nhị phân.",
  "Định nghĩa cây tìm kiếm nhị phân.",
  "So sánh cây nhị phân và cây tìm kiếm nhị phân.",
  "Giải thích khái niệm đồ thị.",
  "Định nghĩa đồ thị vô hướng và đồ thị có hướng.",
  "Định nghĩa thuật toán duyệt đồ thị BFS.",
  "Định nghĩa thuật toán duyệt đồ thị DFS.",
  "So sánh BFS và DFS.",
  "Viết chương trình tìm đường đi ngắn nhất trong đồ thị sử dụng thuật toán Dijkstra.",
  "Giải thích khái niệm lập trình hướng đối tượng (OOP).",
  "Định nghĩa lớp (class) trong OOP.",
  "Định nghĩa đối tượng (object) trong OOP.",
  "Giải thích khái niệm kế thừa trong OOP.",
  "Giải thích khái niệm đa hình trong OOP.",
  "Giải thích khái niệm đóng gói trong OOP.",
  "Viết lớp mô tả một hình chữ nhật.",
  "Viết lớp mô tả một hình tròn.",
  "Viết chương trình sử dụng kế thừa để tạo lớp hình tam giác kế thừa từ lớp hình chữ nhật.",
  "Giải thích khái niệm trừu tượng hóa trong OOP.",
  "Viết một lớp trừu tượng trong Java.",
  "Viết một giao diện (interface) trong Java.",
  "So sánh lớp trừu tượng và giao diện.",
  "Giải thích khái niệm exception handling.",
  "Cách xử lý ngoại lệ trong Java sử dụng try-catch.",
  "Cách xử lý ngoại lệ trong C++ sử dụng try-catch.",
  "Viết chương trình xử lý ngoại lệ khi chia cho 0.",
  "Giải thích khái niệm file I/O.",
  "Cách đọc dữ liệu từ file trong C++.",
  "Cách ghi dữ liệu vào file trong Java.",
  "Viết chương trình đọc nội dung của một file văn bản.",
  "Viết chương trình ghi nội dung vào một file văn bản.",
  "So sánh file I/O trong C++ và Java.",
  "Giải thích khái niệm cơ sở dữ liệu.",
  "Định nghĩa SQL.",
  "Viết câu lệnh SQL để tạo bảng.",
  "Viết câu lệnh SQL để thêm dữ liệu vào bảng.",
  "Viết câu lệnh SQL để truy vấn dữ liệu từ bảng.",
  "Viết câu lệnh SQL để cập nhật dữ liệu trong bảng.",
  "Viết câu lệnh SQL để xóa dữ liệu khỏi bảng.",
  "Giải thích khái niệm chuẩn hóa cơ sở dữ liệu.",
  "So sánh các dạng chuẩn hóa cơ sở dữ liệu.",
  "Giải thích khái niệm chỉ mục trong cơ sở dữ liệu.",
  "Giải thích khái niệm quan hệ trong cơ sở dữ liệu.",
  "So sánh giữa kiểu dữ liệu int và float trong C++.",
  "Giải thích sự khác biệt giữa ++i và i++ trong C++.",
  "Viết chương trình tính trung bình cộng của một mảng số thực.",
  "Viết chương trình kiểm tra xem một chuỗi có phải là palindrome hay không.",
  "Viết chương trình tìm số lớn thứ hai trong một mảng.",
  "Viết hàm đệ quy tính tổng các số trong một mảng.",
  "Giải thích khái niệm \"Garbage Collection\".",
  "So sánh \"pass by value\" và \"pass by reference\".",
  "Viết chương trình tìm số lượng số nguyên tố trong một khoảng cho trước.",
  "Viết chương trình sắp xếp mảng theo thứ tự giảm dần.",
  "Giải thích khái niệm \"Stack\" và \"Queue\".",
  "Implement một Stack sử dụng mảng.",
  "Implement một Queue sử dụng mảng.",
  "So sánh Stack và Queue.",
  "Viết chương trình chuyển đổi số thập phân sang nhị phân.",
  "Viết chương trình chuyển đổi số nhị phân sang thập phân.",
  "Giải thích khái niệm \"Linked List\".",
  "Implement một singly linked list.",
  "Implement một doubly linked list.",
  "So sánh singly linked list và doubly linked list.",
  "Viết chương trình tìm kiếm một phần tử trong một linked list.",
  "Viết chương trình thêm một phần tử vào đầu của một linked list.",
  "Viết chương trình xóa một phần tử khỏi linked list.",
  "Giải thích khái niệm \"Binary Tree\".",
  "Implement một binary tree.",
  "Viết chương trình duyệt binary tree theo thứ tự pre-order.",
  "Viết chương trình duyệt binary tree theo thứ tự in-order.",
  "Viết chương trình duyệt binary tree theo thứ tự post-order.",
  "Giải thích khái niệm \"Binary Search Tree (BST)\".",
  "Implement một BST.",
  "Viết chương trình thêm một node vào BST.",
  "Viết chương trình xóa một node khỏi BST.",
  "Viết chương trình tìm kiếm một node trong BST.",
  "Giải thích khái niệm \"Hash Table\".",
  "Implement một hash table sử dụng phương pháp chaining.",
  "Implement một hash table sử dụng phương pháp probing.",
  "So sánh chaining và probing trong hash table.",
  "Viết chương trình thêm một phần tử vào hash table.",
  "Viết chương trình tìm kiếm một phần tử trong hash table.",
  "Viết chương trình xóa một phần tử khỏi hash table.",
  "Giải thích khái niệm \"Graph\".",
  "Implement một graph sử dụng adjacency matrix.",
  "Implement một graph sử dụng adjacency list.",
  "So sánh adjacency matrix và adjacency list.",
  "Viết chương trình tìm đường đi giữa hai node trong một graph.",
  "Viết chương trình kiểm tra xem một graph có phải là đồ thị liên thông hay không.",
  "Giải thích khái niệm \"Algorithm\".",
  "Phân tích độ phức tạp thời gian của thuật toán Bubble Sort.",
  "Phân tích độ phức tạp thời gian của thuật toán Merge Sort.",
  "Phân tích độ phức tạp thời gian của thuật toán Quick Sort.",
  "So sánh Bubble Sort, Merge Sort và Quick Sort.",
  "Giải thích khái niệm \"Data Structure\".",
  "So sánh các cấu trúc dữ liệu: Array, Linked List, Stack, Queue, Tree, Graph.",
  "Viết chương trình tính tổng các số chẵn trong một khoảng cho trước.",
  "Viết chương trình tính tích các số lẻ trong một khoảng cho trước.",
  "Viết chương trình in ra bảng cửu chương.",
  "Viết chương trình kiểm tra một năm có phải là năm nhuận hay không.",
  "Viết chương trình tính số ngày trong một tháng.",
  "Viết chương trình in ra hình tam giác sao.",
  "Viết chương trình in ra hình chữ nhật sao.",
  "Viết chương trình xử lý chuỗi ký tự: tìm độ dài, in hoa, in thường, cắt chuỗi.",
  "Viết chương trình kiểm tra một email có hợp lệ hay không.",
  "Viết chương trình kiểm tra một số điện thoại có hợp lệ hay không.",
  "Viết chương trình tính tổng các chữ số của một số nguyên.",
  "Viết chương trình đảo ngược một chuỗi ký tự.",
  "Viết chương trình kiểm tra hai chuỗi có là anagram của nhau hay không.",
  "Giải thích khái niệm \"Recursion\".",
  "Viết hàm đệ quy tính số mũ.",
  "Viết hàm đệ quy tìm ước số chung lớn nhất (GCD).",
  "Viết hàm đệ quy tìm bội số chung nhỏ nhất (LCM).",
  "Giải thích khái niệm \"Dynamic Programming\".",
  "Ứng dụng Dynamic Programming để giải bài toán knapsack.",
  "Ứng dụng Dynamic Programming để giải bài toán Fibonacci.",
  "Giải thích khái niệm \"Greedy Algorithm\".",
  "Ứng dụng Greedy Algorithm để giải bài toán tìm đường đi ngắn nhất.",
  "Ứng dụng Greedy Algorithm để giải bài toán sắp xếp công việc.",
  "Giải thích khái niệm \"Divide and Conquer\".",
  "Ứng dụng Divide and Conquer để giải bài toán Merge Sort.",
  "Ứng dụng Divide and Conquer để giải bài toán Quick Sort.",
  "So sánh các phương pháp thiết kế thuật toán: Dynamic Programming, Greedy Algorithm, Divide and Conquer.",
  "Thiết kế một chương trình quản lý sinh viên.",
  "Thiết kế một chương trình quản lý sách trong thư viện.",
  "Thiết kế một chương trình quản lý điểm thi.",
  "Thiết kế một chương trình tính tiền trong siêu thị.",
  "Thiết kế một chương trình quản lý nhân viên.",
  "Viết chương trình giải phương trình bậc nhất.",
  "Viết chương trình giải phương trình bậc hai.",
  "Viết chương trình tính diện tích tam giác khi biết 3 cạnh.",
  "Viết chương trình tính thể tích hình cầu.",
  "Viết chương trình tính thể tích hình trụ.",
  "Viết chương trình tính lãi suất ngân hàng.",
  "Viết chương trình tính tiền điện.",
  "Viết chương trình tính tiền nước.",
  "Viết chương trình tính thuế thu nhập cá nhân.",
  "Viết chương trình quản lý danh bạ.",
  "Viết chương trình quản lý lịch hẹn.",
  "Viết chương trình quản lý công việc.",
  "Viết chương trình quản lý tài chính cá nhân.",
  "Viết chương trình chơi trò chơi đoán số.",
  "Viết chương trình chơi trò chơi ô chữ.",
  "So sánh ưu nhược điểm của ngôn ngữ lập trình C++ và Java.",
  "Nêu những ứng dụng thực tế của lập trình hướng đối tượng.",
  "Tại sao cần phải viết code sạch và có cấu trúc tốt?",
  "Giải thích tầm quan trọng của việc test code.",
  "Nêu các bước để giải quyết một bài toán lập trình.",
  "Thế nào là một thuật toán hiệu quả?",
  "Làm thế nào để tối ưu hóa code để tăng hiệu suất?",
  "Giải thích khái niệm \"Big O Notation\".",
  "Phân tích độ phức tạp thời gian của một thuật toán sử dụng Big O Notation.",
  "Phân tích độ phức tạp không gian của một thuật toán sử dụng Big O Notation.",
  "Giải thích khái niệm \"Version Control\" (ví dụ Git).",
  "Tại sao cần sử dụng Version Control trong lập trình?",
  "Nêu một số lệnh Git cơ bản.",
  "Giải thích khái niệm \"Software Development Life Cycle (SDLC)\".",
  "Mô tả các giai đoạn trong một chu kỳ SDLC.",
  "So sánh các mô hình SDLC khác nhau (ví dụ Waterfall, Agile).",
  "Giải thích khái niệm \"Debugging\".",
  "Nêu các kỹ thuật và công cụ hỗ trợ Debugging.",
  "Làm thế nào để viết code dễ bảo trì?",
  "Làm thế nào để hợp tác hiệu quả trong một dự án lập trình?",
  "Giải thích khái niệm \"Design Pattern\".",
  "Nêu một số Design Pattern phổ biến.",
  "Ứng dụng Design Pattern vào một bài toán lập trình cụ thể.",
  "Giải thích khái niệm \"API\".",
  "Cách sử dụng API trong lập trình.",
  "Nêu một số API phổ biến.",
  "Giải thích khái niệm \"Framework\".",
  "Nêu một số Framework phổ biến.",
  "Ứng dụng Framework vào một bài toán lập trình cụ thể.",
  "Giải thích khái niệm \"Library\".",
  "Nêu một số Library phổ biến.",
  "Ứng dụng Library vào một bài toán lập trình cụ thể.",
  "Làm thế nào để học lập trình hiệu quả?",
  "Nêu các nguồn tài nguyên học lập trình hữu ích.",
  "Làm thế nào để giải quyết vấn đề khi gặp khó khăn trong lập trình?",
  "Làm thế nào để tự tin hơn trong việc lập trình?",
  "Thế nào là lập trình viên giỏi?",
  "Làm thế nào để trở thành một lập trình viên giỏi?",
  "Những kỹ năng mềm nào cần thiết cho một lập trình viên?",
  "Tầm quan trọng của việc học hỏi và cập nhật kiến thức trong lập trình.",
  "Mô tả một dự án lập trình mà bạn muốn thực hiện.",
  "Bạn sẽ áp dụng những kiến thức nào đã học để thực hiện dự án đó?",
  "Những thách thức nào bạn có thể gặp phải trong quá trình thực hiện dự án?",
  "Làm thế nào để bạn vượt qua những thách thức đó?",
  "Bạn sẽ đánh giá thành công của dự án như thế nào?",
  "Mô tả một tình huống thực tế cần sử dụng lập trình để giải quyết.",
  "Bạn sẽ thiết kế chương trình như thế nào để giải quyết tình huống đó?",
  "Những công nghệ và kỹ thuật nào bạn sẽ sử dụng?",
  "Những yếu tố nào cần được xem xét để đảm bảo chương trình hoạt động hiệu quả và chính xác?",
  "Bạn sẽ kiểm thử chương trình như thế nào để đảm bảo chất lượng?",
  "Hãy định nghĩa thuật ngữ \"biến\" trong lập trình.",
  "Giải thích sự khác biệt giữa kiểu dữ liệu số nguyên và số thực.",
  "Mô tả cú pháp của câu lệnh gán trong ngôn ngữ lập trình mà bạn đang học.",
  "Viết chương trình in ra màn hình dòng chữ \"Hello, world!\".",
  "Giải thích khái niệm \"chuỗi ký tự\" và cách khai báo một biến chuỗi.",
  "Viết chương trình nhập vào tên của người dùng và in ra lời chào \"Chào bạn, [tên người dùng]!\".",
  "So sánh toán tử \"==\" và toán tử \"!=\".",
  "Giải thích cách hoạt động của câu lệnh điều kiện \"if-else\".",
  "Viết chương trình kiểm tra xem một số nguyên có chia hết cho 2 không.",
  "Viết chương trình tính tổng của hai số nguyên được nhập từ bàn phím.",
  "Giải thích vòng lặp \"for\" và cú pháp của nó.",
  "Viết chương trình in ra các số từ 1 đến 10.",
  "Giải thích vòng lặp \"while\" và cú pháp của nó.",
  "Viết chương trình tính tổng các số từ 1 đến n, với n được nhập từ bàn phím.",
  "So sánh vòng lặp \"for\" và vòng lặp \"while\".",
  "Giải thích khái niệm \"mảng\" trong lập trình.",
  "Khai báo một mảng chứa 10 số nguyên.",
  "Viết chương trình tính tổng các phần tử của một mảng.",
  "Viết chương trình tìm phần tử lớn nhất trong một mảng.",
  "Viết chương trình tìm phần tử nhỏ nhất trong một mảng.",
  "Giải thích khái niệm \"hàm\" trong lập trình.",
  "Viết một hàm tính tổng của hai số nguyên.",
  "Viết một hàm tính giai thừa của một số nguyên.",
  "Giải thích cách truyền tham số vào hàm.",
  "Giải thích sự khác biệt giữa tham trị và tham chiếu.",
  "Viết chương trình sử dụng hàm để tính diện tích hình chữ nhật.",
  "Viết chương trình sử dụng hàm để tính chu vi hình tròn.",
  "Giải thích khái niệm \"đệ quy\".",
  "Viết một hàm tính giai thừa sử dụng đệ quy.",
  "Viết chương trình tính số Fibonacci thứ n sử dụng đệ quy.",
  "Giải thích khái niệm \"cấu trúc dữ liệu\".",
  "Mô tả cấu trúc dữ liệu \"danh sách liên kết\".",
  "Mô tả cấu trúc dữ liệu \"cây nhị phân\".",
  "Mô tả cấu trúc dữ liệu \"stack\".",
  "Mô tả cấu trúc dữ liệu \"queue\".",
  "Viết chương trình sử dụng stack để kiểm tra xem một chuỗi có phải là palindrome hay không.",
  "Viết chương trình sử dụng queue để mô phỏng một hàng đợi.",
  "Giải thích khái niệm \"con trỏ\" trong lập trình C/C++.",
  "Khai báo một con trỏ đến kiểu dữ liệu số nguyên.",
  "Giải thích cách sử dụng toán tử & và * với con trỏ.",
  "Viết chương trình sử dụng con trỏ để trao đổi giá trị của hai biến.",
  "Giải thích khái niệm \"đa hình\" trong lập trình hướng đối tượng.",
  "Giải thích khái niệm \"kế thừa\" trong lập trình hướng đối tượng.",
  "Giải thích khái niệm \"đóng gói\" trong lập trình hướng đối tượng.",
  "Giải thích khái niệm \"trừu tượng\" trong lập trình hướng đối tượng.",
  "Viết một lớp trong lập trình hướng đối tượng mô tả một hình chữ nhật.",
  "Viết một lớp trong lập trình hướng đối tượng mô tả một hình tròn.",
  "Viết một chương trình sử dụng kế thừa để tạo ra một lớp con kế thừa từ lớp cha.",
  "Giải thích tầm quan trọng của việc viết code rõ ràng, dễ đọc và có chú thích.",
  "Giải thích cách sử dụng debugger để gỡ lỗi chương trình.",
  "Cách xử lý lỗi \"Division by zero\" trong chương trình.",
  "Cách xử lý lỗi \"Index out of bounds\" trong chương trình.",
  "Cách xử lý lỗi \"NullPointerException\" trong chương trình.",
  "So sánh hai thuật toán sắp xếp khác nhau (ví dụ: sắp xếp nổi bọt và sắp xếp chọn).",
  "So sánh hai thuật toán tìm kiếm khác nhau (ví dụ: tìm kiếm tuyến tính và tìm kiếm nhị phân).",
  "Phân tích độ phức tạp thời gian của thuật toán sắp xếp nổi bọt.",
  "Phân tích độ phức tạp thời gian của thuật toán tìm kiếm nhị phân.",
  "Giải thích khái niệm \"đệ quy\" và cho ví dụ về một bài toán có thể giải quyết bằng đệ quy.",
  "Viết chương trình tìm ước số chung lớn nhất (UCLN) của hai số nguyên bằng thuật toán Euclid.",
  "Viết chương trình tìm bội số chung nhỏ nhất (BCNN) của hai số nguyên.",
  "Giải thích cách sử dụng cấu trúc dữ liệu \"mảng hai chiều\".",
  "Viết chương trình nhập vào ma trận và in ra ma trận đó.",
  "Viết chương trình tính tổng các phần tử trên đường chéo chính của một ma trận vuông.",
  "Viết chương trình tìm phần tử lớn nhất trong một ma trận.",
  "Giải thích khái niệm \"file\" trong lập trình.",
  "Viết chương trình đọc dữ liệu từ một file văn bản.",
  "Viết chương trình ghi dữ liệu vào một file văn bản.",
  "Cách xử lý ngoại lệ khi đọc hoặc ghi file.",
  "Giải thích khái niệm \"exception handling\" trong lập trình.",
  "Viết chương trình sử dụng câu lệnh \"try-catch\" để xử lý ngoại lệ.",
  "Giải thích cách sử dụng các lệnh nhập xuất chuẩn (stdin, stdout, stderr).",
  "Viết chương trình chuyển đổi số thập phân sang số nhị phân.",
  "Viết chương trình chuyển đổi số nhị phân sang số thập phân.",
  "Viết chương trình tính tổng các chữ số của một số nguyên.",
  "Viết chương trình kiểm tra xem một số nguyên có phải là số nguyên tố hay không.",
  "Viết chương trình tìm tất cả các số nguyên tố trong một khoảng cho trước.",
  "Giải thích khái niệm \"recursion\" và cho ví dụ về một bài toán có thể giải quyết bằng recursion.",
  "Viết chương trình tính số hạng thứ n của dãy Fibonacci bằng vòng lặp.",
  "Viết chương trình tính diện tích của một tam giác.",
  "Viết chương trình tính thể tích của một hình lập phương.",
  "Viết chương trình tính diện tích của một hình thang.",
  "Viết chương trình tính thể tích của một hình trụ.",
  "Viết chương trình tính thể tích của một hình cầu.",
  "Viết chương trình sắp xếp một mảng số nguyên theo thứ tự tăng dần.",
  "Viết chương trình sắp xếp một mảng số nguyên theo thứ tự giảm dần.",
  "Viết chương trình tìm kiếm một phần tử trong một mảng số nguyên.",
  "Viết chương trình tìm kiếm một chuỗi con trong một chuỗi lớn hơn.",
  "Viết chương trình đảo ngược một chuỗi.",
  "Viết chương trình kiểm tra xem một chuỗi có phải là palindrome hay không.",
  "Viết chương trình đếm số lần xuất hiện của một ký tự trong một chuỗi.",
  "Viết chương trình xóa khoảng trắng thừa ở đầu và cuối của một chuỗi.",
  "Viết chương trình tách một chuỗi thành các từ.",
  "Viết chương trình nối hai chuỗi lại với nhau.",
  "Viết chương trình chuyển đổi chữ thường sang chữ hoa và ngược lại.",
  "Viết chương trình tìm vị trí của một ký tự trong một chuỗi.",
  "Viết chương trình thay thế một ký tự bằng một ký tự khác trong một chuỗi.",
  "Viết chương trình kiểm tra xem một chuỗi có chứa một chuỗi con hay không.",
  "Viết chương trình tìm chuỗi con dài nhất trong một chuỗi.",
  "Giải thích cách hoạt động của một hàm băm.",
  "Viết chương trình tạo ra một hàm băm đơn giản.",
  "Giải thích khái niệm \"collision\" trong hàm băm.",
  "Giải thích các phương pháp giải quyết \"collision\" trong hàm băm.",
  "So sánh các phương pháp giải quyết \"collision\" trong hàm băm.",
  "Viết chương trình sử dụng cấu trúc dữ liệu \"hash table\".",
  "Viết chương trình tìm kiếm một phần tử trong \"hash table\".",
  "Viết chương trình thêm một phần tử vào \"hash table\".",
  "Viết chương trình xóa một phần tử khỏi \"hash table\".",
  "Giải thích khái niệm \"linked list\".",
  "Viết chương trình tạo ra một \"linked list\" đơn giản.",
  "Viết chương trình thêm một nút vào \"linked list\".",
  "Viết chương trình xóa một nút khỏi \"linked list\".",
  "Viết chương trình tìm kiếm một nút trong \"linked list\".",
  "Viết chương trình đảo ngược một \"linked list\".",
  "So sánh \"linked list\" và \"array\".",
  "Giải thích khái niệm \"tree\".",
  "Giải thích khái niệm \"binary tree\".",
  "Viết chương trình tạo ra một \"binary tree\".",
  "Viết chương trình duyệt \"binary tree\" theo thứ tự trước, giữa và sau.",
  "Viết chương trình tìm kiếm một nút trong \"binary tree\".",
  "Viết chương trình thêm một nút vào \"binary tree\".",
  "Viết chương trình xóa một nút khỏi \"binary tree\".",
  "Giải thích khái niệm \"binary search tree\".",
  "Viết chương trình tạo ra một \"binary search tree\".",
  "Viết chương trình tìm kiếm một nút trong \"binary search tree\".",
  "Viết chương trình thêm một nút vào \"binary search tree\".",
  "Viết chương trình xóa một nút khỏi \"binary search tree\".",
  "So sánh \"binary tree\" và \"binary search tree\".",
  "Giải thích khái niệm \"graph\".",
  "Giải thích khái niệm \"directed graph\".",
  "Giải thích khái niệm \"undirected graph\".",
  "Viết chương trình tạo ra một \"graph\" đơn giản.",
  "Viết chương trình duyệt \"graph\" bằng thuật toán \"breadth-first search\".",
  "Viết chương trình duyệt \"graph\" bằng thuật toán \"depth-first search\".",
  "Viết chương trình tìm kiếm đường đi ngắn nhất trong \"graph\" bằng thuật toán Dijkstra.",
  "Viết chương trình tìm kiếm cây khung nhỏ nhất trong \"graph\" bằng thuật toán Prim.",
  "Giải thích khái niệm \"sorting algorithm\".",
  "So sánh các thuật toán sắp xếp khác nhau (ví dụ: bubble sort, insertion sort, selection sort, merge sort, quick sort).",
  "Phân tích độ phức tạp thời gian và không gian của các thuật toán sắp xếp khác nhau.",
  "Giải thích khái niệm \"searching algorithm\".",
  "So sánh các thuật toán tìm kiếm khác nhau (ví dụ: linear search, binary search).",
  "Phân tích độ phức tạp thời gian và không gian của các thuật toán tìm kiếm khác nhau.",
  "Giải thích khái niệm \"dynamic programming\".",
  "Cho ví dụ về một bài toán có thể giải quyết bằng dynamic programming.",
  "Viết chương trình tính số Fibonacci thứ n bằng dynamic programming.",
  "Viết chương trình tính tổng các con số trong một mảng sử dụng dynamic programming.",
  "Giải thích khái niệm \"greedy algorithm\".",
  "Cho ví dụ về một bài toán có thể giải quyết bằng greedy algorithm.",
  "Viết chương trình tìm cây khung nhỏ nhất trong \"graph\" bằng greedy algorithm.",
  "Viết chương trình giải bài toán \"Knapsack problem\" bằng greedy algorithm.",
  "Giải thích khái niệm \"backtracking\".",
  "Cho ví dụ về một bài toán có thể giải quyết bằng backtracking.",
  "Viết chương trình tìm kiếm tất cả các tổ hợp của một tập hợp.",
  "Viết chương trình giải bài toán \"N-Queens problem\" bằng backtracking.",
  "Giải thích khái niệm \"branch and bound\".",
  "Cho ví dụ về một bài toán có thể giải quyết bằng branch and bound.",
  "Viết chương trình giải bài toán \"Traveling Salesman Problem\" bằng branch and bound.",
  "Giải thích khái niệm \"Divide and Conquer\".",
  "Cho ví dụ về một bài toán có thể giải quyết bằng Divide and Conquer.",
  "Viết chương trình sắp xếp mảng sử dụng thuật toán Merge Sort.",
  "Viết chương trình tìm kiếm trong mảng sử dụng thuật toán Binary Search.",
  "Giải thích khái niệm \"abstraction\" trong lập trình hướng đối tượng.",
  "Giải thích khái niệm \"encapsulation\" trong lập trình hướng đối tượng.",
  "Giải thích khái niệm \"polymorphism\" trong lập trình hướng đối tượng.",
  "Viết chương trình minh họa khái niệm \"polymorphism\" trong lập trình hướng đối tượng.",
  "Giải thích sự khác biệt giữa lớp trừu tượng và giao diện.",
  "Viết chương trình minh họa sự khác biệt giữa lớp trừu tượng và giao diện.",
  "Giải thích khái niệm \"inheritance\" trong lập trình hướng đối tượng.",
  "Viết chương trình minh họa khái niệm \"inheritance\" trong lập trình hướng đối tượng.",
  "Giải thích khái niệm \"composition\" trong lập trình hướng đối tượng.",
  "Viết chương trình minh họa khái niệm \"composition\" trong lập trình hướng đối tượng.",
  "So sánh \"inheritance\" và \"composition\".",
  "Giải thích khái niệm \"design pattern\".",
  "Mô tả một số design pattern phổ biến (ví dụ: Singleton, Factory, Observer).",
  "Viết chương trình minh họa một design pattern cụ thể.",
  "Giải thích tầm quan trọng của việc viết code sạch và có cấu trúc tốt.",
  "Giải thích tầm quan trọng của việc viết code có chú thích.",
  "Giải thích tầm quan trọng của việc kiểm thử code.",
  "Giải thích các phương pháp kiểm thử code (ví dụ: unit testing, integration testing).",
  "Giải thích khái niệm \"version control\".",
  "Giới thiệu về Git và các lệnh cơ bản của Git.",
  "Viết chương trình tính toán tiền lãi ngân hàng.",
  "Viết chương trình quản lý danh sách sinh viên.",
  "Viết chương trình quản lý thư viện.",
  "Viết chương trình quản lý điểm thi.",
  "Viết chương trình chơi trò chơi ô chữ.",
  "Viết chương trình chơi trò chơi đoán số.",
  "Viết chương trình hiển thị lịch.",
  "Viết chương trình chuyển đổi đơn vị đo lường.",
  "Viết chương trình tính toán diện tích các hình học khác nhau.",
  "Viết chương trình tính toán thể tích các hình khối khác nhau.",
  "Thiết kế một chương trình quản lý kho hàng đơn giản.",
  "Thiết kế một chương trình quản lý bán hàng đơn giản.",
  "Thiết kế một chương trình quản lý khách hàng đơn giản.",
  "Thiết kế một chương trình quản lý nhân viên đơn giản.",
  "Thiết kế một trò chơi đơn giản sử dụng đồ họa (ví dụ: game rắn săn mồi).",
  "Mô tả quá trình phát triển phần mềm theo mô hình thác nước.",
  "Mô tả quá trình phát triển phần mềm theo mô hình Agile.",
  "So sánh mô hình thác nước và mô hình Agile.",
  "Giải thích khái niệm \"test-driven development\".",
  "Viết chương trình tính toán tiền lương nhân viên, bao gồm lương cơ bản, phụ cấp và thuế.",
  "Viết chương trình quản lý một danh sách bài hát.",
  "Viết chương trình tính toán điểm trung bình của một học sinh.",
  "Viết chương trình tìm kiếm một sản phẩm trong một cửa hàng online.",
  "Viết chương trình quản lý lịch làm việc của một nhóm người.",
  "Xây dựng một ứng dụng nhỏ quản lý danh bạ.",
  "Xây dựng một ứng dụng nhỏ quản lý task đơn giản.",
  "Xây dựng một ứng dụng nhỏ ghi chú.",
  "Viết một chương trình tính toán số ngày giữa hai ngày bất kỳ.",
  "Viết chương trình kiểm tra xem một năm có phải là năm nhuận hay không.",
  "Viết chương trình tính toán khoảng cách giữa hai điểm trên mặt phẳng tọa độ.",
  "Viết chương trình tính toán diện tích của một đa giác bất kỳ.",
  "Viết chương trình giải phương trình bậc hai.",
  "Viết chương trình tính toán lãi suất kép.",
  "Viết chương trình mô phỏng việc tung xúc xắc.",
  "Viết chương trình mô phỏng việc xáo trộn một bộ bài.",
  "Viết chương trình tạo ra một mã số ngẫu nhiên.",
  "Viết chương trình mã hóa và giải mã một chuỗi văn bản.",
  "Viết chương trình tìm kiếm đường đi ngắn nhất trong một mê cung.",
  "Viết chương trình giải bài toán xếp lịch trình công việc.",
  "Viết chương trình kiểm tra xem một biểu thức toán học có hợp lệ hay không.",
  "Viết chương trình tính toán giá trị của một biểu thức toán học hậu tố.",
  "Viết chương trình thực hiện sắp xếp nổi bọt (Bubble Sort).",
  "Viết chương trình thực hiện sắp xếp chọn (Selection Sort).",
  "Viết chương trình thực hiện sắp xếp chèn (Insertion Sort).",
  "Viết chương trình thực hiện tìm kiếm tuyến tính.",
  "Viết chương trình thực hiện tìm kiếm nhị phân.",
  "Giải thích thuật toán tìm kiếm nhị phân hoạt động như thế nào.",
  "Giải thích tại sao tìm kiếm nhị phân hiệu quả hơn tìm kiếm tuyến tính.",
  "Viết chương trình kiểm tra tính đối xứng của một ma trận.",
  "Viết chương trình nhân hai ma trận.",
  "Viết chương trình chuyển đổi một số từ hệ thập phân sang hệ hexademical.",
  "Viết chương trình chuyển đổi một số từ hệ hexademical sang hệ thập phân.",
  "Viết chương trình tính tổng các số lẻ từ 1 đến n.",
  "Viết chương trình tính tổng các số chẵn từ 1 đến n.",
  "Viết chương trình tìm số lớn nhất trong một dãy số.",
  "Viết chương trình tìm số nhỏ nhất trong một dãy số.",
  "Viết chương trình tính giai thừa của một số bằng vòng lặp.",
  "Viết chương trình tính tổng các số Fibonacci từ 1 đến n.",
  "Viết chương trình tính tổng các chữ số của một số.",
  "Viết chương trình kiểm tra xem một số có phải là số hoàn hảo hay không.",
  "Viết chương trình tìm số lượng ước số của một số.",
  "Viết chương trình kiểm tra xem một số có phải là số Armstrong hay không.",
  "Viết chương trình in ra bảng cửu chương.",
  "Viết chương trình tính diện tích tam giác bằng công thức Heron.",
  "Viết chương trình tính khoảng cách giữa hai điểm trong không gian 3 chiều.",
  "Viết chương trình tìm ước số chung lớn nhất (UCLN) của nhiều số.",
  "Viết chương trình tìm bội số chung nhỏ nhất (BCNN) của nhiều số.",
  "Viết chương trình kiểm tra tính nguyên tố của một số lớn.",
  "Viết chương trình thực hiện thuật toán sắp xếp nhanh (Quick Sort).",
  "Viết chương trình thực hiện thuật toán sắp xếp trộn (Merge Sort)."
]